app/interactions/college_students/destroy_college_student.rb

  def execute
    college_student.destroy
---
DELETE FROM "college_students" WHERE "college_students"."id" = $1  [["id", 2]]