app/interactions/college_students/find_college_student.rb

SELECT "college_students".* FROM "college_students" WHERE "college_students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def execute
    college_student = CollegeStudent.find_by_id(id)