app/interactions/college_students/update_college_student.rb

  def execute
    college_student.name = name if name.present?
    college_student.email = email if email.present?

    unless college_student.save
---
UPDATE "college_students" SET "email" = $1, "updated_at" = $2 WHERE "college_students"."id" = $3  [["email", "rfactor78@.com"], ["updated_at", "2021-03-11 08:55:28.658399"], ["id", 2]]