app/controllers/college_students_controller.rb

INSERT INTO "college_students" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sarthak"], ["email", "sarthak.gmail.com"], ["created_at", "2021-03-12 07:44:57.545834"], ["updated_at", "2021-03-12 07:44:57.545834"]]
---
  def create
    @college_student = CollegeStudent.new(college_student_params)

    respond_to do |format|
      if @college_student.save

SELECT "college_students".* FROM "college_students" WHERE "college_students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_college_student
      @college_student = CollegeStudent.find(params[:id])